In [1]:
import pandas as pd

In [2]:
renew_invest_df = pd.read_csv("Data/renewable-energy-investment.csv")
renew_invest_df

,Entity,Code,Year,Investment in Renewables by Region (IRENA (2016))
0,Americas (excl. US and Brazil),NaN,2004,1.73
1,Americas (excl. US and Brazil),NaN,2005,3.32
2,Americas (excl. US and Brazil),NaN,2006,3.71
3,Americas (excl. US and Brazil),NaN,2007,5.01
4,Americas (excl. US and Brazil),NaN,2008,6.05
...,...,...,...,...
91,United States of America,NaN,2011,49.06
92,United States of America,NaN,2012,40.65
93,United States of America,NaN,2013,35.33
94,United States of America,NaN,2014,37.05
95,United States of America,NaN,2015,44.11

In [3]:
total_renew_invest = renew_invest_df.groupby(["Year"]).sum()

In [4]:
total_renew_invest = pd.DataFrame(total_renew_invest)

In [5]:
total_renew_invest = total_renew_invest.rename(columns= {"Investment in Renewables by Region (IRENA (2016))":"Renewables_Investment"})

In [6]:
total_renew_invest

      Renewables_Investment
Year
2004                  46.60
2005                  72.84
2006                 112.03
2007                 154.02
2008                 182.19
2009                 178.68
2010                 239.19
2011                 278.50
2012                 257.28
2013                 233.99
2014                 273.03
2015                 285.93

In [7]:
global_warming_parameters = pd.read_csv("Data/All_parameters.csv")

In [8]:
global_warming_parameters

,Year,Gas Fuel,Liquid Fuel,Solid Fuel,Cement,Gas Flaring,population,GCAG_TEMP,GIS_TEMP,Sea_anomaly_temp,GMSL,CO2_Increase,CSIRO Adjusted Sea Level,Glacier_mass
0,1880,0.0,3.0,233.0,0.0,0.0,2.785161e+09,-0.1148,-0.20,-0.470009,-158.7,NaN,0.000000,NaN
1,1881,0.0,4.0,239.0,0.0,0.0,1.374792e+09,-0.0628,-0.12,-0.356879,-153.1,NaN,0.220472,NaN
2,1882,0.0,4.0,252.0,0.0,0.0,1.384401e+09,-0.0648,-0.10,-0.372661,-169.9,NaN,-0.440945,NaN
3,1883,0.0,3.0,269.0,0.0,0.0,1.394147e+09,-0.1424,-0.21,-0.448443,-164.6,NaN,-0.232283,NaN
4,1884,0.0,4.0,271.0,0.0,0.0,1.403721e+09,-0.2009,-0.28,-0.589754,-143.7,NaN,0.590551,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
133,2013,NaN,NaN,NaN,NaN,NaN,NaN,0.6679,0.65,0.584674,67.7,2.41,8.980315,-27.817
134,2014,NaN,NaN,NaN,NaN,NaN,NaN,0.7408,0.74,0.751255,NaN,2.04,NaN,-28.652
135,2015,NaN,NaN,NaN,NaN,NaN,NaN,0.8998,0.87,0.935577,NaN,2.94,NaN,NaN
136,2016,NaN,NaN,NaN,NaN,NaN,NaN,0.9363,0.99,NaN,NaN,2.86,NaN,NaN
137,2017,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.14,NaN,NaN